import Keyboard from "@/app/components/keyboard";
import { threeSet391Layout } from "./kong/threeSetKongLayouts";
import { shinThreeSetLayout } from "./shin/threeSetShinLayouts";
import Link from "next/link";

export default function Layouts() {
  return (
    <article>
      <h2>세벌식</h2>
      <p><strong>세벌식</strong> 배열은 낱자 키가 자음 두 벌 (초성 한 벌과 종성 한 벌)과 모음 한 벌, 총 세 벌로 구성된 배열을 뜻합니다. 초성을 입력할 때와 종성을 입력할 때 서로 다른 키를 사용하기에, 두벌식 배열을 사용할 때와는 달리 도깨비불 현상이 나타나지 않습니다.</p>

      <h3>공병우 박사의 3-90·3-91 배열</h3>
      <p>공병우 박사가 타자기용 세벌식 배열을 개발한 이후, 이를 바탕으로 1990년과 1991년에 각각 컴퓨터용 세벌식 배열인 3-90과 3-91 배열이 공개되었습니다. 두 배열 모두 한글을 입력하는 데 숫자 행에 있는 키까지 사용했기에, 배열을 익히는 것이 두벌식보다 어렵고 숫자를 입력하는 것이 불편하다는 단점이 있습니다.</p>
      <div className="h-4"></div>
      <Keyboard labelData={threeSet391Layout} />
      <p>위 배열은 가장 대표적인 세벌식 배열로, 공병우 박사가 개발한 3-91 배열입니다.</p>
      <p>공병우 박사가 개발한 3-90 및 3-91 배열과, 여기에서 파생된 배열들에 대한 자세한 설명은 <Link href="threeset/kong">공병우 세벌식</Link> 문서를 참조하십시오.</p>

      <h3>신광조의 신세벌식 배열</h3>
      <p>1995년, 신광조는 공병우 배열의 한글 배치를 바탕으로 신세벌식 배열을 공개하였습니다. 왼손의 키가 상황에 따라 중성과 종성 중 적절한 것을 자동으로 입력하도록 설계하여, 숫자 행과 shift 키 없이도 현대 한글 음절을 온전히 입력할 수 있게 되었습니다. 이처럼 하나의 키가 상황에 따라 다른 낱자를 입력하는 기능을 <strong>갈마들이</strong>라고 부릅니다.</p>
      <div className="h-4"></div>
      <Keyboard labelData={shinThreeSetLayout} />
      <p>위 배열은 신광조가 개발한 신세벌식 배열입니다.</p>
      <p>신광조가 개발한 신세벌식 배열과, 여기에서 파생된 배열들에 대한 자세한 설명은 <Link href="threeset/shin">신광조 세벌식</Link> 문서를 참조하십시오.</p>

      <h3>다양한 세벌식 배열의 등장</h3>
      <p>날개셋 한글 입력기가 등장한 이후, 세벌식 배열을 더 편리하게 사용할 수 있도록 연구·개선하는 사용자가 늘어났습니다. 이러한 배열은 크게 공병우 세벌식과 신광조 세벌식으로 나뉩니다. 대략적으로 설명하면, <strong>공병우 세벌식</strong> 배열은 3-90 또는 3-91 배열을 계승하여, 숫자 행까지 한글 낱자 키가 배치되어 있고 갈마들이를 (거의) 사용하지 않습니다. 반면 <strong>신광조 세벌식</strong> 배열은 신세벌식 배열을 계승하여, 한글 입력에 숫자 행을 사용하지 않으며 중-종성 갈마들이가 적극적으로 사용됩니다.</p>
      {/* <p>두 계열의 배열 모두 일반적으로 오른손으로 초성을, 왼손으로 중성과 종성을 입력합니다. 초성은 기본자 14자를 모두 바로 입력할 수 있으며, 쌍자음은 대응하는 홑자음 키를 두 번 눌러 입력합니다. 공병우 세벌식 배열의 경우 중성은 왼손 검지·중지, 종성은 약지·소지로 입력하며, 사용되는 빈도가 낮은 낱자는 숫자 행이나 <code>shift</code> 키의 조합으로 입력해야 합니다. 신광조 세벌식 배열의 경우 일반적으로는 왼손으로 종성을 입력하며, 초성이 입력되고 중성이 입력되지 않은 상태에서만 중성이 입력됩니다. 중성을 단독으로 입력하고자 하는 경우에는 왼손 키를 <code>shift</code>&nbsp;키와 함께 누르면 됩니다.</p> */}

      <h3>모아치기 세벌식 배열</h3>
      <p>한편, 초성·중성·종성 키가 모두 따로 있다는 점에 착안하여, 여러 키를 동시에 눌러 한 번에 한 음절을 완성하는 <strong>모아치기 세벌식</strong> 배열도 존재합니다. 2003년 안마태 신부가 개발한 안마태 소리 글판이나, 2015년 신세기가 개발한 세모이 (세벌식 모아치기 e) 배열이 대표적입니다. 모아치기 배열과 상반되게, 기존과 같이 한 타에 하나의 낱자를 입력하는 배열은 ‘이어치기 배열’이라고 부르기도 합니다.</p>
      <p>모아치기 세벌식 배열에 관한 자세한 설명은 <Link href="threeset/chorded">모아치기 세벌식</Link> 문서를 참조하십시오.</p>
    </article>
  )
}
